list1=["python","java","c++"]
list2=list1
print("list1:",id(list1))
print("list2:",id(list2))
list2.append("c#")
print(list1)
print(list2)
print("-------------")
#1-بله
#2- چون هردو داخل یک خونه ادرس بودند و بعد از تغییر هردو تغییر کردند
#3-نه هردو به یک شی اشاره میکنند
list1=["python","java","c++"]
list2=list1.copy()
print("list1:",id(list1))
print("list2:",id(list2))
list2.append("c#")
print(list1)
print(list2)
print("-------------")

x=100
y=x
print(id(x))
print(id(y))
y=200
print(x)
print(y)
print(id(x))
print(id(y))
#متغیر محلی در حافظه است که برای ذخیره کردن داده‌ها استفاده می‌شود. هر متغیر به یک مقدار یا شیء اشاره می‌کند.
#در پایتون همه چیز شیء (Object) است؛ یعنی هر عدد، رشته، لیست و... یک شیء است که مقدار، نوع و ویژگی‌های خودش را دارد.
#کپی مرجع:در این حالت هر دو متغیر به یک لیست اشاره می‌کنند. اگر یکی تغییر کند، دیگری هم تغییر می‌کند. کپی شی: در این حالت یک لیست جدید ساخته می‌شود و تغییرات list2 روی list1 تأثیری ندارد.
#چون اعداد تغییرناپذیر (Immutable) هستند، اما لیست‌ها تغییرپذیر (Mutable) هستند.